; domain
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; Hanoi Tower
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
(define (domain HANOI)
	(:requirements :strips :typing :negative-preconditions)
	(:types disk case)
	(:predicates
		(on_disk ?d1 - disk ?d2 - disk)
		(bigger ?d1 - disk ?d2 - disk)
		(on_case ?d1 - disk ?c - case)
		(clear_disk ?d - disk)
		(clear_case ?c - case)
		(handempty)
		(holding ?d - disk)
	)

	(:action pick_up
		 :parameters (?d - disk ?c - case)
	     	 :precondition (and (clear_disk ?d) (on_case ?d ?c) (handempty))
	     	 :effect
	     	 (and (not (on_case ?d ?c))
		      (clear_case ?c)
		      (not (clear_disk ?d))
		      (not (handempty))
		      (holding ?d)
		 )
	)
	(:action unstack
 		 :parameters (?d - disk ?d2 - disk)
	     	 :precondition (and (clear_disk ?d) (on_disk ?d ?d2) (handempty))
	     	 :effect
	     	 (and (not (on_disk ?d ?d2))
		      (not (clear_disk ?d))
		      	   (clear_disk ?d2)
		      (not (handempty))
		      (holding ?d)
		 )
	)

	(:action put_down
		 :parameters (?d - disk ?c - case)
		 :precondition (and (clear_case ?c) (holding ?d) )
		 :effect
		 (and (not (clear_case ?c))
		      (not (holding ?d))
		      (clear_disk ?d)
		      (on_case ?d ?c)
		      (handempty)
		 )
	)

	(:action stack
		 :parameters (?d1 - disk ?d2 - disk)
		 :precondition (and (clear_disk ?d2) (holding ?d1) (bigger ?d2 ?d1))
		 :effect
		 (and (not (clear_disk ?d2))
		      (not (holding ?d1))
		      (on_disk ?d1 ?d2)
		      (clear_disk ?d1)
		      (handempty)
		 )
	)
)

; problem
(define (problem HANOI_4)
(:domain HANOI)
(:objects D1 D2 D3 D4 D5 D6 - disk
	  C1 C2 C3 - case
)
(:init
	(handempty)
	(bigger D1 D2)
	(bigger D1 D3)
	(bigger D1 D4)
	(bigger D1 D5)
	(bigger D1 D6)
	(bigger D2 D3)
	(bigger D2 D4)
	(bigger D2 D5)
	(bigger D2 D6)
	(bigger D3 D4)
	(bigger D3 D5)
	(bigger D3 D5)
	(bigger D3 D6)
	(bigger D4 D5)
    (bigger D4 D6)
    (bigger D5 D6)
	(on_case D1 C1)
    (on_disk D4 D1)
	(on_case D2 C2)
    (on_disk D5 D2)
	(on_case D3 C3)
    (on_disk D6 D3)
    (clear_disk D4)
    (clear_disk D5)
    (clear_disk D6)
)
(:goal
	(and (on_case D1 C1)
	     (on_disk D2 D1)
	     (on_disk D3 D2)
	     (on_disk D4 D3)
	     (on_disk D4 D3)
	     (on_disk D6 D5)	
	     (handempty)
	)
))

; plan
1. (unstack d6 d3)
   deleted: (on_disk d6 d3) (clear_disk d6) (handempty)
   added: (clear_disk d3) (holding d6)
   goals met: 1 of 7
2. (stack d6 d5)
   deleted: (clear_disk d5) (holding d6)
   added: (on_disk d6 d5) (clear_disk d6) (handempty)
   goals met: 3 of 7
3. (unstack d4 d1)
   deleted: (on_disk d4 d1) (clear_disk d4) (handempty)
   added: (clear_disk d1) (holding d4)
   goals met: 2 of 7
4. (stack d4 d3)
   deleted: (clear_disk d3) (holding d4)
   added: (on_disk d4 d3) (clear_disk d4) (handempty)
   goals met: 5 of 7
5. (unstack d6 d5)
   deleted: (on_disk d6 d5) (clear_disk d6) (handempty)
   added: (clear_disk d5) (holding d6)
   goals met: 3 of 7
6. (stack d6 d4)
   deleted: (clear_disk d4) (holding d6)
   added: (on_disk d6 d4) (clear_disk d6) (handempty)
   goals met: 4 of 7
7. (unstack d5 d2)
   deleted: (on_disk d5 d2) (clear_disk d5) (handempty)
   added: (clear_disk d2) (holding d5)
   goals met: 3 of 7
8. (stack d5 d1)
   deleted: (clear_disk d1) (holding d5)
   added: (on_disk d5 d1) (clear_disk d5) (handempty)
   goals met: 4 of 7
9. (unstack d6 d4)
   deleted: (on_disk d6 d4) (clear_disk d6) (handempty)
   added: (clear_disk d4) (holding d6)
   goals met: 3 of 7
10. (stack d6 d2)
   deleted: (clear_disk d2) (holding d6)
   added: (on_disk d6 d2) (clear_disk d6) (handempty)
   goals met: 4 of 7
11. (unstack d5 d1)
   deleted: (on_disk d5 d1) (clear_disk d5) (handempty)
   added: (clear_disk d1) (holding d5)
   goals met: 3 of 7
12. (stack d5 d4)
   deleted: (clear_disk d4) (holding d5)
   added: (on_disk d5 d4) (clear_disk d5) (handempty)
   goals met: 4 of 7
13. (unstack d6 d2)
   deleted: (on_disk d6 d2) (clear_disk d6) (handempty)
   added: (clear_disk d2) (holding d6)
   goals met: 3 of 7
14. (stack d6 d5)
   deleted: (clear_disk d5) (holding d6)
   added: (on_disk d6 d5) (clear_disk d6) (handempty)
   goals met: 5 of 7
15. (pick_up d2 c2)
   deleted: (on_case d2 c2) (clear_disk d2) (handempty)
   added: (clear_case c2) (holding d2)
   goals met: 4 of 7
16. (stack d2 d1)
   deleted: (clear_disk d1) (holding d2)
   added: (on_disk d2 d1) (clear_disk d2) (handempty)
   goals met: 6 of 7
17. (unstack d6 d5)
   deleted: (on_disk d6 d5) (clear_disk d6) (handempty)
   added: (clear_disk d5) (holding d6)
   goals met: 4 of 7
18. (stack d6 d2)
   deleted: (clear_disk d2) (holding d6)
   added: (on_disk d6 d2) (clear_disk d6) (handempty)
   goals met: 5 of 7
19. (unstack d5 d4)
   deleted: (on_disk d5 d4) (clear_disk d5) (handempty)
   added: (clear_disk d4) (holding d5)
   goals met: 4 of 7
20. (put_down d5 c2)
   deleted: (clear_case c2) (holding d5)
   added: (clear_disk d5) (on_case d5 c2) (handempty)
   goals met: 5 of 7
21. (unstack d6 d2)
   deleted: (on_disk d6 d2) (clear_disk d6) (handempty)
   added: (clear_disk d2) (holding d6)
   goals met: 4 of 7
22. (stack d6 d4)
   deleted: (clear_disk d4) (holding d6)
   added: (on_disk d6 d4) (clear_disk d6) (handempty)
   goals met: 5 of 7
23. (pick_up d5 c2)
   deleted: (on_case d5 c2) (clear_disk d5) (handempty)
   added: (clear_case c2) (holding d5)
   goals met: 4 of 7
24. (stack d5 d2)
   deleted: (clear_disk d2) (holding d5)
   added: (on_disk d5 d2) (clear_disk d5) (handempty)
   goals met: 5 of 7
25. (unstack d6 d4)
   deleted: (on_disk d6 d4) (clear_disk d6) (handempty)
   added: (clear_disk d4) (holding d6)
   goals met: 4 of 7
26. (stack d6 d5)
   deleted: (clear_disk d5) (holding d6)
   added: (on_disk d6 d5) (clear_disk d6) (handempty)
   goals met: 6 of 7
27. (unstack d4 d3)
   deleted: (on_disk d4 d3) (clear_disk d4) (handempty)
   added: (clear_disk d3) (holding d4)
   goals met: 3 of 7
28. (put_down d4 c2)
   deleted: (clear_case c2) (holding d4)
   added: (clear_disk d4) (on_case d4 c2) (handempty)
   goals met: 4 of 7
29. (unstack d6 d5)
   deleted: (on_disk d6 d5) (clear_disk d6) (handempty)
   added: (clear_disk d5) (holding d6)
   goals met: 2 of 7
30. (stack d6 d3)
   deleted: (clear_disk d3) (holding d6)
   added: (on_disk d6 d3) (clear_disk d6) (handempty)
   goals met: 3 of 7
31. (unstack d5 d2)
   deleted: (on_disk d5 d2) (clear_disk d5) (handempty)
   added: (clear_disk d2) (holding d5)
   goals met: 2 of 7
32. (stack d5 d4)
   deleted: (clear_disk d4) (holding d5)
   added: (on_disk d5 d4) (clear_disk d5) (handempty)
   goals met: 3 of 7
33. (unstack d6 d3)
   deleted: (on_disk d6 d3) (clear_disk d6) (handempty)
   added: (clear_disk d3) (holding d6)
   goals met: 2 of 7
34. (stack d6 d5)
   deleted: (clear_disk d5) (holding d6)
   added: (on_disk d6 d5) (clear_disk d6) (handempty)
   goals met: 4 of 7
35. (pick_up d3 c3)
   deleted: (on_case d3 c3) (clear_disk d3) (handempty)
   added: (clear_case c3) (holding d3)
   goals met: 3 of 7
36. (stack d3 d2)
   deleted: (clear_disk d2) (holding d3)
   added: (on_disk d3 d2) (clear_disk d3) (handempty)
   goals met: 5 of 7
37. (unstack d6 d5)
   deleted: (on_disk d6 d5) (clear_disk d6) (handempty)
   added: (clear_disk d5) (holding d6)
   goals met: 3 of 7
38. (stack d6 d3)
   deleted: (clear_disk d3) (holding d6)
   added: (on_disk d6 d3) (clear_disk d6) (handempty)
   goals met: 4 of 7
39. (unstack d5 d4)
   deleted: (on_disk d5 d4) (clear_disk d5) (handempty)
   added: (clear_disk d4) (holding d5)
   goals met: 3 of 7
40. (put_down d5 c3)
   deleted: (clear_case c3) (holding d5)
   added: (clear_disk d5) (on_case d5 c3) (handempty)
   goals met: 4 of 7
41. (unstack d6 d3)
   deleted: (on_disk d6 d3) (clear_disk d6) (handempty)
   added: (clear_disk d3) (holding d6)
   goals met: 3 of 7
42. (stack d6 d5)
   deleted: (clear_disk d5) (holding d6)
   added: (on_disk d6 d5) (clear_disk d6) (handempty)
   goals met: 5 of 7
43. (pick_up d4 c2)
   deleted: (on_case d4 c2) (clear_disk d4) (handempty)
   added: (clear_case c2) (holding d4)
   goals met: 4 of 7
44. (stack d4 d3)
   deleted: (clear_disk d3) (holding d4)
   added: (on_disk d4 d3) (clear_disk d4) (handempty)
   goals met: 7 of 7
